Revit 2027 API
SketchEditScope.IsSketchEditingSupportedForSketchBasedElement Method
 Checks whether the element supports sketch editing.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsSketchEditingSupportedForSketchBasedElement(
	ElementId elemId
)
Public Function IsSketchEditingSupportedForSketchBasedElement (
	elemId As ElementId
) As Boolean
public:
bool IsSketchEditingSupportedForSketchBasedElement(
	ElementId^ elemId
)
member IsSketchEditingSupportedForSketchBasedElement :
        elemId : ElementId -> bool
Parameters
elemId ElementId
 The element id to be checked.
Return Value
Boolean
 True if element supports sketch editing, false otherwise.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
Remarks
 This method checks if the element supports edit to all its sketches. If you want to check if this element supports edit to a particular sketch please use IsSketchEditingSupported(ElementId).
See Also
Reference
SketchEditScope Class
Autodesk.Revit.DB Namespace